# Use with `brew bundle`
#
# install: `brew bundle --no-lock --file=~/.Brewfile`
# list homebrew formula not in this Brewfile: `brew bundle cleanup --file=~/.Brewfile`
# uninstall homebrew formule not listed in this brew file: `brew bundle cleanup --force --file=~/.Brewfile`

#
# Command-line Tools
# 
brew "awscli"
brew "nvm"
brew "stow"
brew "tmux"
brew "mas" # mac appstore cli

#
# Applications
# 

cask "1password"
cask "alfred"
cask "choosy"
cask "dbngin"
cask "docker"
cask "elgato-stream-deck"
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "setapp"
cask "slack"
cask "tailscale"
cask "vlc"
cask "zoom"
cask "sparrow" # bitcoin wallet

#
# Mac AppStore
#

mas "Zerion Wallet: Crypto & Web3", id: 1456732565
